davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
#include "opendisplay_ble.h"
#include "od_hal_i2c.h"
#include "od_nfc_app.h"
#include "opendisplay_config_parser.h"
#include "opendisplay_display.h"
#include "opendisplay_led.h"
#include "opendisplay_pipe.h"
#include "opendisplay_constants.h"
#include "od_advert.h"
#include "app.h"
#include "app_assert.h"
#include "gatt_db.h"
#include "em_cmu.h"
#include "em_core.h"
#include "em_emu.h"
#include "em_gpio.h"
#include "em_iadc.h"
#include "em_system.h"
#include "sl_gpio.h"
#include "sl_sleeptimer.h"
#include "sl_udelay.h"
#include <stdio.h>
#include <string.h>

#define MSD_PAYLOAD_LEN        OD_ADVERT_MSD_LEN
#define OD_NAME_PREFIX         "OD"
#ifndef OD_FW_VERSION
#define OD_FW_VERSION ""
#endif
#ifndef OD_APP_VERSION
#define OD_APP_VERSION         0x0100u
#endif

static const char *fw_build_version_string(void)
{
  const char *v = OD_FW_VERSION;

  if (v == NULL || v[0] == '\0') {
    return NULL;
  }
  if (v[0] == '"') {
    v++;
  }
  if (v[0] == '\0') {
    return NULL;
  }
  return v;
}

static uint8_t fw_major_from_build_version(void)
{
  const char *v = fw_build_version_string();

  if (v == NULL) {
    return 0;
  }
  while (*v == ' ' || *v == 'v' || *v == 'V') {
    v++;
  }
  if (*v < '0' || *v > '9') {
    return 0;
  }
  unsigned maj = 0U;
  while (*v >= '0' && *v <= '9') {
    maj = maj * 10U + (unsigned)(*v - '0');
    v++;
  }
  if (maj > 255U) {
    maj = 255U;
  }
  return (uint8_t)maj;
}

static uint8_t fw_minor_from_build_version(void)
{
  const char *v = fw_build_version_string();

  if (v == NULL) {
    return 0;
  }
  while (*v == ' ' || *v == 'v' || *v == 'V') {
    v++;
  }
  while (*v >= '0' && *v <= '9') {
    v++;
  }
  if (*v != '.') {
    return 0;
  }
  v++;
  if (*v < '0' || *v > '9') {
    return 0;
  }
  unsigned min = 0U;
  while (*v >= '0' && *v <= '9') {
    min = min * 10U + (unsigned)(*v - '0');
    v++;
  }
  if (min > 255U) {
    min = 255U;
  }
  return (uint8_t)min;
}

static uint8_t fw_patch_from_build_version(void)
{
  const char *v = fw_build_version_string();

  if (v == NULL) {
    return 0;
  }
  while (*v == ' ' || *v == 'v' || *v == 'V') {
    v++;
  }
  while (*v >= '0' && *v <= '9') {
    v++;
  }
  if (*v != '.') {
    return 0;
  }
  v++;
  while (*v >= '0' && *v <= '9') {
    v++;
  }
  if (*v != '.') {
    return 0;
  }
  v++;
  if (*v < '0' || *v > '9') {
    return 0;
  }
  unsigned patch = 0U;
  while (*v >= '0' && *v <= '9') {
    patch = patch * 10U + (unsigned)(*v - '0');
    v++;
  }
  if (patch > 255U) {
    patch = 255U;
  }
  return (uint8_t)patch;
}

/* BLE adv interval in units of 0.625 ms (used when not connected / undirected adv). */
#define OD_ADV_INTERVAL_IDLE_SLOTS 1600u
#define OD_ADV_INTERVAL_BOOST_MIN    32u
#define OD_ADV_INTERVAL_BOOST_MAX    48u
#define OD_ADV_BOOST_MS              3000u
#define OD_MSD_UPDATE_INTERVAL_MS  30000u
#define BUTTON_ID_MASK             0x07u
#define PRESS_COUNT_MASK           0x0Fu
#define PRESS_COUNT_SHIFT          3u
#define BUTTON_STATE_SHIFT         7u
#define OD_MAX_CONNECTION_MS       300000u

/* OD_TNB132M_BOOT_PROBE=1 (e.g. -DOD_TNB132M_BOOT_PROBE=1): read the phone-visible
 * NDEF via TNB132M at boot and log it over RTT. Type-3 AI lives at I2C 0x48 sub=0;
 * NDEF data blocks are byte-offset reads at I2C 0x40 sub=0x10/0x20/... The tag
 * caches only AI+Nbr blocks per anchor (Nbr=2 here), so each data block read is
 * preceded by a fresh 0x48 sub=0 anchor.
 *
 * OD_TNB132M_WRITE_NDEF=1 (requires BOOT_PROBE): before the read, write a Well-Known
 * Text record containing OD_TNB132M_NDEF_TEXT (UTF-8, lang=en). Max 25 chars so the
 * record fits in AI + 2 data blocks (Nbr=2 cache). Leaves WriteFlag=0x00 and RWFlag
 * untouched so the NFC Forum "read/write" bit keeps its factory value.
 *
 * Power is still removed at end of od_nfc_init_sequence(). */
#ifndef OD_TNB132M_BOOT_PROBE
#define OD_TNB132M_BOOT_PROBE 0
#endif
#ifndef OD_TNB132M_WRITE_NDEF
#define OD_TNB132M_WRITE_NDEF 0
#endif
#ifndef OD_TNB132M_NDEF_TEXT
#define OD_TNB132M_NDEF_TEXT "OpenDisplay"
#endif

static uint8_t msd_payload[MSD_PAYLOAD_LEN];
static uint8_t msd_loop_counter;
static uint8_t dynamic_return[OD_ADVERT_DYNAMIC_LEN];
static uint8_t reboot_flag = 1u;
static uint8_t connection_requested = 0u;

static uint16_t g_od_pipe_char;
static uint8_t g_connection = 0xFFu;
static uint8_t s_adv_handle = 0xFFu;
static char s_dev_name[16];
static struct GlobalConfig s_od_global_config;
static uint32_t s_last_msd_refresh_ms;
static uint32_t s_adv_boost_until_ms;
static bool s_pending_dfu;
static bool s_pending_deep_sleep;
static uint32_t s_connection_open_ms;
static bool s_connection_timeout_close_requested;
static uint32_t s_last_batt_measure_ms;
static uint16_t s_batt_voltage_mv_cache;

static GPIO_Port_TypeDef s_od_flash_mosi_port = gpioPortA;
static uint8_t s_od_flash_mosi_pin = 0u;
static GPIO_Port_TypeDef s_od_flash_sck_port = gpioPortA;
static uint8_t s_od_flash_sck_pin = 0u;
static GPIO_Port_TypeDef s_od_flash_cs_port = gpioPortA;
static uint8_t s_od_flash_cs_pin = 0u;
static bool s_od_flash_enabled;

/* NFC / bit-bang I2C lines: initialized only from explicit NFC config packet. */
/* The DataBus instance the NFC session runs on. The pin statics below stay, because parking SCL
 * and SDA after a session is adapter policy that the transport does not own. */
static uint8_t s_od_nfc_bus_instance = 0xFFu;
static GPIO_Port_TypeDef s_od_nfc_scl_port = gpioPortA;
static uint8_t s_od_nfc_scl_pin = 0u;
static GPIO_Port_TypeDef s_od_nfc_sda_port = gpioPortA;
static uint8_t s_od_nfc_sda_pin = 0u;
static GPIO_Port_TypeDef s_od_nfc_pwr_port = gpioPortA;
static uint8_t s_od_nfc_pwr_pin = 0u;
static bool s_od_nfc_has_pwr_pin;
static bool s_od_nfc_enabled;
static uint8_t s_od_nfc_ic_type;
static uint8_t s_od_nfc_power_on_delay_ms = 40u;

typedef struct {
  bool enabled;
  uint8_t pin_cfg;
  uint8_t mode;
  bool active_high;
  uint8_t debounce_ms;
  uint8_t adv_button_byte_index;
  uint8_t adv_button_id;
  uint8_t state;
  uint32_t last_change_ms;
  int32_t int_no;
  int32_t em4_int_no;
  volatile bool irq_pending;
} od_nfc_field_detect_t;
static od_nfc_field_detect_t s_od_nfc_field_detect;
static void od_nfc_field_detect_irq_callback(uint8_t int_no, void *context);
static uint32_t s_od_nfc_field_scan_counter;
static uint8_t s_od_nfc_write_blocks[512];
static uint8_t s_od_nfc_read_data[128];
static uint8_t s_od_nfc_read_throwaway[16];

