davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
typedef struct {
  bool active;
  uint8_t pin_cfg;
  int32_t int_no;
  int32_t em4_int_no;
  uint8_t button_id;
  uint8_t byte_index;
  bool inverted;
  uint8_t press_count;
  uint8_t current_state;
} od_button_state_t;
static od_button_state_t s_buttons[32];
static uint8_t s_button_count;
static volatile bool s_button_msd_dirty;

static sl_status_t build_and_apply_adv(uint8_t adv_set, const char *name, bool quick);
static void od_boost_advertising(uint32_t now_ms);
static sl_status_t od_apply_advertising_timing(uint8_t adv_handle, uint32_t now_ms);

#if defined(__GNUC__)
extern uint32_t __ResetReasonStart__;
#endif

typedef struct {
  uint16_t reason;
  uint16_t signature;
} od_bootloader_reset_cause_t;

#define OD_BTL_RESET_REASON_BOOTLOAD    0x0202u
#define OD_BTL_RESET_SIGNATURE_VALID    0xF00Fu

static void od_enter_gecko_bootloader(void)
{
#if defined(__GNUC__)
  uintptr_t base = (uintptr_t)&__ResetReasonStart__;
#else
  uintptr_t base = 0x20000000u;
#endif
  od_bootloader_reset_cause_t *cause = (od_bootloader_reset_cause_t *)base;
  cause->reason = OD_BTL_RESET_REASON_BOOTLOAD;
  cause->signature = OD_BTL_RESET_SIGNATURE_VALID;
  NVIC_SystemReset();
}

static bool od_advertising_api_ok(sl_status_t sc, const char *operation)
{
  if (sc == SL_STATUS_OK) {
    return true;
  }
  printf("[OD] FATAL: %s failed sc=0x%04lX; entering bootloader\r\n",
         operation, (unsigned long)sc);
  od_enter_gecko_bootloader();
  return false;
}

static bool od_pin_decode(uint8_t v, GPIO_Port_TypeDef *port_out, uint8_t *pin_out)
{
  if (v == GPIO_PIN_UNUSED) {
    return false;
  }
  unsigned pr = (unsigned)(v >> 4) & 0x0Fu;
  unsigned pn = (unsigned)(v & 0x0Fu);
  if (pr > (unsigned)GPIO_PORT_MAX || pn > 15u) {
    return false;
  }
  *port_out = (GPIO_Port_TypeDef)(gpioPortA + pr);
  *pin_out = (uint8_t)pn;
  return true;
}

static uint8_t od_read_button_pin(uint8_t pin_cfg)
{
  GPIO_Port_TypeDef port;
  uint8_t pin;
  if (!od_pin_decode(pin_cfg, &port, &pin)) {
    return 0u;
  }
  return (uint8_t)(GPIO_PinInGet(port, pin) != 0);
}

static void od_setup_button_pin(uint8_t pin_cfg, bool pullup, bool pulldown)
{
  GPIO_Port_TypeDef port;
  uint8_t pin;
  if (!od_pin_decode(pin_cfg, &port, &pin)) {
    return;
  }
  if (pullup) {
    GPIO_PinModeSet(port, pin, gpioModeInputPull, 1);
  } else if (pulldown) {
    GPIO_PinModeSet(port, pin, gpioModeInputPull, 0);
  } else {
    GPIO_PinModeSet(port, pin, gpioModeInput, 0);
  }
}

static void od_button_irq_callback(uint8_t int_no, void *context)
{
  od_button_state_t *st = (od_button_state_t *)context;
  uint8_t pin_state;
  uint8_t logical_state;
  uint8_t encoded;

  (void)int_no;
  if (st == NULL || !st->active) {
    return;
  }
  pin_state = od_read_button_pin(st->pin_cfg);
  logical_state = (st->inverted ? (pin_state == 0u) : (pin_state != 0u)) ? 1u : 0u;
  if (logical_state == st->current_state) {
    return;
  }
  st->current_state = logical_state;
  if (logical_state != 0u) {
    st->press_count = (uint8_t)((st->press_count + 1u) & PRESS_COUNT_MASK);
  }
  encoded = (uint8_t)((st->button_id & BUTTON_ID_MASK)
            | ((st->press_count & PRESS_COUNT_MASK) << PRESS_COUNT_SHIFT)
            | ((st->current_state & 0x01u) << BUTTON_STATE_SHIFT));
  dynamic_return[st->byte_index] = encoded;
  s_button_msd_dirty = true;
  app_proceed();
}

static void od_buttons_deinit_interrupts(void)
{
  uint8_t i;
  for (i = 0u; i < s_button_count; i++) {
    od_button_state_t *st = &s_buttons[i];
    if (st->active && st->int_no >= 0) {
      (void)sl_gpio_deconfigure_external_interrupt(st->int_no);
      st->int_no = -1;
    }
    if (st->active && st->em4_int_no >= 0) {
      (void)sl_gpio_deconfigure_wakeup_em4_interrupt(st->em4_int_no);
      st->em4_int_no = -1;
    }
  }
}

static void od_buttons_init_from_config(void)
{
  const struct GlobalConfig *cfg = &s_od_global_config;
  uint8_t i;
  uint8_t bi;

  od_buttons_deinit_interrupts();
  s_button_count = 0u;
  s_button_msd_dirty = false;
  memset(s_buttons, 0, sizeof(s_buttons));
  printf("[OD][BTN] init: binary_input_count=%u\r\n", (unsigned)cfg->binary_input_count);
  for (i = 0; i < cfg->binary_input_count; i++) {
    const struct BinaryInputs *input = &cfg->binary_inputs[i];
    const uint8_t local_pins[8] = {
      input->input_pin_1, input->input_pin_2, input->input_pin_3, input->input_pin_4,
      input->input_pin_5, input->input_pin_6, input->input_pin_7, input->input_pin_8
    };
    if (input->input_type != 1u || input->button_data_byte_index >= sizeof(dynamic_return)) {
      printf("[OD][BTN] skip instance=%u input_type=%u byte_index=%u\r\n",
             (unsigned)input->instance_number,
             (unsigned)input->input_type,
             (unsigned)input->button_data_byte_index);
      continue;
    }
    printf("[OD][BTN] instance=%u byte_index=%u invert=0x%02X pullup=0x%02X pulldown=0x%02X\r\n",
           (unsigned)input->instance_number,
           (unsigned)input->button_data_byte_index,
           (unsigned)input->invert,
           (unsigned)input->pullups,
           (unsigned)input->pulldowns);
    for (bi = 0u; bi < 8u && s_button_count < (uint8_t)(sizeof(s_buttons) / sizeof(s_buttons[0])); bi++) {
      od_button_state_t *st;
      bool pullup;
      bool pulldown;
      bool pressed;
      uint8_t pin_state_raw;
      uint8_t pin_cfg = local_pins[bi];
      bool pin_used = (input->pins_used & (uint8_t)(1u << bi)) != 0u;
      if (!pin_used) {
        continue;
      }
      if (pin_cfg == GPIO_PIN_UNUSED) {
        printf("[OD][BTN] skip used slot=%u pin=0xFF (not configured)\r\n", (unsigned)bi);
        continue;
      }
      st = &s_buttons[s_button_count];
      pullup = (input->pullups & (uint8_t)(1u << bi)) != 0u;
      pulldown = (input->pulldowns & (uint8_t)(1u << bi)) != 0u;
      od_setup_button_pin(pin_cfg, pullup, pulldown);
      st->active = true;
      st->pin_cfg = pin_cfg;
      st->button_id = (uint8_t)(((input->instance_number * 8u) + bi) & BUTTON_ID_MASK);
      st->byte_index = input->button_data_byte_index;
      st->inverted = (input->invert & (uint8_t)(1u << bi)) != 0u;
      st->int_no = -1;
      st->em4_int_no = -1;
      pin_state_raw = od_read_button_pin(pin_cfg);
      pressed = st->inverted ? (pin_state_raw == 0u) : (pin_state_raw != 0u);
      st->current_state = pressed ? 1u : 0u;
      dynamic_return[st->byte_index] =
        (uint8_t)((st->button_id & BUTTON_ID_MASK) | ((st->current_state & 0x01u) << BUTTON_STATE_SHIFT));
      printf("[OD][BTN] arm idx=%u slot=%u pin=0x%02X button_id=%u pin_state=%s init_state=%u\r\n",
             (unsigned)s_button_count,
             (unsigned)bi,
             (unsigned)pin_cfg,
             (unsigned)st->button_id,
             pin_state_raw ? "HIGH" : "LOW",
             (unsigned)st->current_state);
      {
        sl_gpio_t gpio = {
          .port = (sl_gpio_port_t)(pin_cfg >> 4),
          .pin = (pin_cfg & 0x0Fu)
        };
        int32_t int_no = -1;
        if (sl_gpio_configure_external_interrupt(&gpio,
                                                 &int_no,
                                                 SL_GPIO_INTERRUPT_RISING_FALLING_EDGE,
                                                 od_button_irq_callback,
                                                 st) == SL_STATUS_OK) {
          st->int_no = int_no;
          printf("[OD][BTN] irq ok idx=%u int_no=%ld\r\n",
                 (unsigned)s_button_count, (long)st->int_no);
        } else {
          printf("[OD][BTN] irq fail idx=%u pin=0x%02X\r\n",
                 (unsigned)s_button_count, (unsigned)pin_cfg);
        }
      }
      s_button_count++;
    }
  }
  printf("[OD][BTN] init done active_buttons=%u\r\n", (unsigned)s_button_count);
}

