davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
static void od_publish_button_msd(uint8_t adv_handle, uint32_t now_ms)
{
  if (!s_button_msd_dirty || adv_handle == 0xFFu || g_connection != 0xFFu) {
    return;
  }
  s_button_msd_dirty = false;
  od_boost_advertising(now_ms);
  (void)sl_bt_advertiser_stop(adv_handle);
  if (!od_advertising_api_ok(build_and_apply_adv(adv_handle, s_dev_name, true),
                             "button advertising data update") ||
      !od_advertising_api_ok(od_apply_advertising_timing(adv_handle, now_ms),
                             "button advertising timing") ||
      !od_advertising_api_ok(sl_bt_legacy_advertiser_start(
                                 adv_handle, sl_bt_legacy_advertiser_connectable),
                             "button advertising restart")) {
    return;
  }
}

static void od_buttons_arm_em4_wakeup(void)
{
  uint8_t i;
  for (i = 0u; i < s_button_count; i++) {
    od_button_state_t *st = &s_buttons[i];
    sl_gpio_t gpio;
    int32_t em4_int_no = SL_GPIO_INTERRUPT_UNAVAILABLE;
    sl_status_t sc;
    bool wake_polarity_high;

    if (!st->active) {
      continue;
    }
    gpio.port = (sl_gpio_port_t)(st->pin_cfg >> 4);
    gpio.pin = (st->pin_cfg & 0x0Fu);
    wake_polarity_high = !st->inverted;
    sc = sl_gpio_configure_wakeup_em4_interrupt(&gpio,
                                                &em4_int_no,
                                                wake_polarity_high,
                                                od_button_irq_callback,
                                                st);
    if (sc == SL_STATUS_OK) {
      st->em4_int_no = em4_int_no;
      printf("[OD][BTN] EM4 wake armed pin=0x%02X em4_int=%ld polarity=%s\r\n",
             (unsigned)st->pin_cfg,
             (long)em4_int_no,
             wake_polarity_high ? "high" : "low");
    } else {
      printf("[OD][BTN] EM4 wake arm failed pin=0x%02X sc=0x%04lX\r\n",
             (unsigned)st->pin_cfg, (unsigned long)sc);
    }
  }
}

static bool od_nfc_type3_paged_block_read16(uint8_t bus_id, uint8_t dev7, uint8_t sub,
                                            uint8_t *out16)
{
  if (out16 == NULL) {
    return false;
  }
  /* START, addr|W, sub, REPEATED START, addr|R, 16 bytes with the last NACKed -- one
   * transaction, which is what write_read means. */
  return od_hal_i2c_write_read(bus_id, dev7, &sub, 1u, out16, 16u) == OD_HAL_I2C_OK;
}

#if OD_TNB132M_BOOT_PROBE

/* Type-3 NDEF read: 0x48 sub=0 returns the NFC Forum Attribute Information
 * (Ver|Nbr|Nbw|Nmaxb|rsv[4]|WriteFlag|RWFlag|Ln[3]|Sum[2]); NDEF data blocks are
 * byte-offset reads at dev=0x40 (sub=0x10 for blk1, 0x20 for blk2, ..). TNB132M
 * caches only AI + Nbr data blocks (Nbr=2 here) per anchor, so re-anchor via
 * 0x48 sub=0 before each data read so block 3+ still lands in the cache window.
 * Decodes the first record's TNF/type/payload so RTT matches phone output. */
static void od_nfc_boot_dump_ndef_t3(GPIO_Port_TypeDef scl_port, uint8_t scl_pin,
                                     GPIO_Port_TypeDef sda_port, uint8_t sda_pin)
{
  uint8_t ai[16];
  uint8_t data[64];
  uint32_t ln;
  uint16_t sum_calc, sum_read;
  unsigned need_blocks;

  if (!od_nfc_type3_paged_block_read16(bus_id, 0x48u, 0x00u, ai)) {
    printf("[OD] NFC ndef AI @0x48 sub=0: NACK\r\n");
    return;
  }
  if (ai[0] != 0x10u) {
    printf("[OD] NFC ndef AI ver=%02x (not 1.x) — skip decode\r\n", ai[0]);
    return;
  }
  ln = ((uint32_t)ai[11] << 16) | ((uint32_t)ai[12] << 8) | (uint32_t)ai[13];
  sum_read = (uint16_t)(((uint16_t)ai[14] << 8) | (uint16_t)ai[15]);
  sum_calc = 0;
  for (unsigned i = 0; i < 14u; i++) {
    sum_calc = (uint16_t)(sum_calc + ai[i]);
  }
  printf("[OD] NFC ndef AI Ver=%u.%u Nbr=%u Nbw=%u Nmaxb=%u RWFlag=%02x Ln=%lu Sum=%04x (calc %04x %s)\r\n",
         (unsigned)(ai[0] >> 4), (unsigned)(ai[0] & 0x0Fu), (unsigned)ai[1], (unsigned)ai[2],
         (unsigned)(((uint16_t)ai[3] << 8) | ai[4]), ai[10], (unsigned long)ln, (unsigned)sum_read,
         (unsigned)sum_calc, sum_calc == sum_read ? "OK" : "BAD");
  if (ln == 0u || ln > sizeof(data)) {
    printf("[OD] NFC ndef Ln=%lu out of range (max %u)\r\n",
           (unsigned long)ln, (unsigned)sizeof(data));
    return;
  }
  need_blocks = (unsigned)((ln + 15u) / 16u);
  for (unsigned b = 0; b < need_blocks; b++) {
    uint8_t byte_off = (uint8_t)(0x10u + b * 0x10u);
    uint8_t throwaway[16];
    (void)od_nfc_type3_paged_block_read16(bus_id, 0x48u, 0x00u,
                                          throwaway);
    sl_udelay_wait(500);
    if (!od_nfc_type3_paged_block_read16(bus_id, 0x40u,
                                         byte_off, &data[b * 16u])) {
      printf("[OD] NFC ndef blk%u @0x40 sub=%02x: NACK\r\n", b + 1u, (unsigned)byte_off);
      return;
    }
    printf("[OD] NFC ndef blk%u %04x:", b + 1u, b * 16u);
    for (unsigned j = 0; j < 16u; j++) {
      printf(" %02x", data[b * 16u + j]);
    }
    printf("\r\n");
    sl_udelay_wait(200);
  }
  {
    uint8_t tnf0 = data[0] & 0x07u;
    if (ln < 4u || tnf0 == 0u || tnf0 >= 6u) {
      printf("[OD] NFC ndef record too short or bad TNF (ln=%lu hdr=%02x tnf=%u)\r\n",
             (unsigned long)ln, data[0], tnf0);
      return;
    }
  }
  {
    uint8_t hdr = data[0];
    uint8_t tnf = hdr & 0x07u;
    bool sr = (hdr & 0x10u) != 0;
    bool il = (hdr & 0x08u) != 0;
    unsigned tlen = data[1];
    unsigned plen;
    unsigned off;
    unsigned ilen = 0;
    if (sr) {
      plen = data[2];
      off = 3u;
    } else {
      if (ln < 6u) {
        printf("[OD] NFC ndef long-format truncated\r\n");
        return;
      }
      plen = ((unsigned)data[2] << 24) | ((unsigned)data[3] << 16) | ((unsigned)data[4] << 8) | data[5];
      off = 6u;
    }
    if (il) {
      if (ln < off + 1u) {
        printf("[OD] NFC ndef IL truncated\r\n");
        return;
      }
      ilen = data[off];
      off += 1u;
    }
    if (off + tlen + ilen + plen > ln) {
      printf("[OD] NFC ndef fields exceed Ln (off=%u tlen=%u il=%u plen=%u ln=%lu)\r\n",
             off, tlen, ilen, plen, (unsigned long)ln);
      return;
    }
    printf("[OD] NFC ndef rec TNF=%u SR=%u IL=%u tlen=%u plen=%u type=\"%.*s\"\r\n",
           tnf, (unsigned)sr, (unsigned)il, tlen, plen, tlen, (const char *)&data[off]);
    off += tlen + ilen;
    if (tnf == 0x01u && tlen == 1u && data[off - tlen - ilen] == 'T' && plen >= 1u) {
      unsigned stat = data[off];
      unsigned lang_len = stat & 0x3Fu;
      if (1u + lang_len <= plen) {
        printf("[OD] NFC ndef Text lang=\"%.*s\" utf%u text=\"%.*s\"\r\n",
               lang_len, (const char *)&data[off + 1u], (stat & 0x80u) ? 16u : 8u,
               (unsigned)(plen - 1u - lang_len), (const char *)&data[off + 1u + lang_len]);
      }
    }
  }
}

#endif /* OD_TNB132M_BOOT_PROBE */

/* Type-3 16-byte block write: START, dev+W, sub, 16 data bytes, STOP. Mirrors the
 * paged read on the write side — AI goes to dev=0x48 sub=0, NDEF data blocks go to
 * dev=0x40 sub=0x10/0x20/... (same byte-offset mapping as the read path). */
static bool od_nfc_type3_paged_block_write16(uint8_t bus_id, uint8_t dev7, uint8_t sub,
                                             const uint8_t *in16)
{
  /* Bounded local, not a heap allocation: sub plus one 16-byte block, on a 32 KB part. */
  uint8_t buf[1u + 16u];

