davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
  if (in16 == NULL) {
    return false;
  }
  buf[0] = sub;
  for (uint8_t i = 0; i < 16u; i++) {
    buf[1u + i] = in16[i];
  }
  return od_hal_i2c_write(bus_id, dev7, buf, (uint16_t)sizeof buf) == OD_HAL_I2C_OK;
}

#if OD_TNB132M_BOOT_PROBE
#if OD_TNB132M_WRITE_NDEF
/* Replace the NDEF with a UTF-8 Text record (lang="en"). Max 25 chars so the whole
 * record fits in AI + 2 data blocks (TNB132M Nbr=2 cache limit). Reads the current
 * AI first to preserve RWFlag so the NFC Forum read/write bit keeps its factory
 * value — we only modify Ln and checksum. */
static bool od_nfc_write_ndef_text_en(GPIO_Port_TypeDef scl_port, uint8_t scl_pin,
                                      GPIO_Port_TypeDef sda_port, uint8_t sda_pin,
                                      const char *text)
{
  uint8_t ai[16] = { 0 };
  uint8_t blocks[32] = { 0 };
  uint8_t cur_ai[16];
  size_t tlen = (text != NULL) ? strlen(text) : 0u;
  unsigned plen;
  unsigned recln;
  uint16_t sum;
  unsigned i;
  unsigned need_blocks;

  if (tlen == 0u || tlen > 25u) {
    printf("[OD] NFC write: text len %u out of range (1..25)\r\n", (unsigned)tlen);
    return false;
  }
  plen = 1u + 2u + (unsigned)tlen;
  recln = 4u + plen;

  blocks[0] = 0xD1u;
  blocks[1] = 0x01u;
  blocks[2] = (uint8_t)plen;
  blocks[3] = 0x54u;
  blocks[4] = 0x02u;
  blocks[5] = (uint8_t)'e';
  blocks[6] = (uint8_t)'n';
  for (i = 0; i < tlen; i++) {
    blocks[7u + i] = (uint8_t)text[i];
  }

  ai[0] = 0x10u;
  ai[1] = 0x02u;
  ai[2] = 0x01u;
  ai[3] = 0x00u;
  ai[4] = 0x3Cu;
  ai[11] = (uint8_t)((recln >> 16) & 0xFFu);
  ai[12] = (uint8_t)((recln >> 8) & 0xFFu);
  ai[13] = (uint8_t)(recln & 0xFFu);
  if (od_nfc_type3_paged_block_read16(bus_id, 0x48u, 0x00u, cur_ai)
      && cur_ai[0] == 0x10u) {
    ai[10] = cur_ai[10];
  }
  sum = 0;
  for (i = 0; i < 14u; i++) {
    sum = (uint16_t)(sum + ai[i]);
  }
  ai[14] = (uint8_t)(sum >> 8);
  ai[15] = (uint8_t)(sum & 0xFFu);

  need_blocks = (recln + 15u) / 16u;
  printf("[OD] NFC write: Ln=%u RWFlag=%02x text=\"%s\" (%u blk)\r\n",
         recln, ai[10], text, need_blocks);
  if (!od_nfc_type3_paged_block_write16(bus_id, 0x48u, 0x00u, ai)) {
    printf("[OD] NFC write: AI @0x48 sub=0 NACK\r\n");
    return false;
  }
  sl_udelay_wait(10000);
  for (i = 0; i < need_blocks; i++) {
    uint8_t byte_off = (uint8_t)(0x10u + i * 0x10u);
    if (!od_nfc_type3_paged_block_write16(bus_id, 0x40u, byte_off,
                                          &blocks[i * 16u])) {
      printf("[OD] NFC write: blk%u @0x40 sub=%02x NACK\r\n", i + 1u, (unsigned)byte_off);
      return false;
    }
    sl_udelay_wait(10000);
  }
  printf("[OD] NFC write: OK\r\n");
  return true;
}
#endif /* OD_TNB132M_WRITE_NDEF */
#endif /* OD_TNB132M_BOOT_PROBE */

/* Wake TNB132M host I2C + open the byte-offset Type-3 data window at 0x40.
 * After EEPROM/block writes via 0x48/0x40, callers must run this again or
 * 0x48 sub=0 still returns updated AI while 0x40 sub=0x10 reads all 0xFF (RF /
 * tag RAM cache repopulates; MCU window must be re-opened). */
static void od_nfc_tnb132m_prime_type3(uint8_t bus_id)
{
  static const uint8_t open_window[2] = { 0x21u, 0x04u };
  static const uint8_t sel_25[1]      = { 0x25u };
  static const uint8_t sel_30[1]      = { 0x30u };
  uint8_t sink1;
  uint8_t sink16[16];

  /* Results are deliberately discarded, as they always were: these are wake/window pokes whose
   * ACKs the deployed sequence never checked, and starting to check them here would be a
   * behaviour change on a transport no board in this fleet can exercise. */
  (void)od_hal_i2c_write(bus_id, 0x30u, open_window, (uint16_t)sizeof open_window);
  (void)od_hal_i2c_write_read(bus_id, 0x30u, sel_25, 1u, &sink1, 1u);

  sl_udelay_wait(20000);

  (void)od_hal_i2c_write_read(bus_id, 0x43u, sel_30, 1u, sink16, (uint16_t)sizeof sink16);
}

static void od_nfc_field_detect_init_from_config(const struct NfcConfig *nfc_cfg)
{
  memset(&s_od_nfc_field_detect, 0, sizeof(s_od_nfc_field_detect));
  s_od_nfc_field_detect.int_no = -1;
  s_od_nfc_field_detect.em4_int_no = -1;
  s_od_nfc_field_scan_counter = 0u;
  if (nfc_cfg == NULL) {
    return;
  }
  if (nfc_cfg->field_detect_mode == 0u || nfc_cfg->field_detect_pin == GPIO_PIN_UNUSED) {
    return;
  }
  s_od_nfc_field_detect.enabled = true;
  s_od_nfc_field_detect.pin_cfg = nfc_cfg->field_detect_pin;
  s_od_nfc_field_detect.mode = nfc_cfg->field_detect_mode;
  s_od_nfc_field_detect.active_high = (nfc_cfg->field_detect_active != 0u);
  s_od_nfc_field_detect.debounce_ms = nfc_cfg->field_detect_debounce_ms;
  s_od_nfc_field_detect.adv_button_byte_index = nfc_cfg->adv_button_byte_index;
  s_od_nfc_field_detect.adv_button_id = (uint8_t)(nfc_cfg->adv_button_button_id & BUTTON_ID_MASK);
  od_setup_button_pin(s_od_nfc_field_detect.pin_cfg, false, false);
  if (s_od_nfc_field_detect.mode == 2u) {
    sl_gpio_t gpio = {
      .port = (sl_gpio_port_t)(s_od_nfc_field_detect.pin_cfg >> 4),
      .pin = (s_od_nfc_field_detect.pin_cfg & 0x0Fu)
    };
    if (sl_gpio_configure_external_interrupt(&gpio,
                                             &s_od_nfc_field_detect.int_no,
                                             SL_GPIO_INTERRUPT_RISING_FALLING_EDGE,
                                             od_nfc_field_detect_irq_callback,
                                             &s_od_nfc_field_detect) == SL_STATUS_OK) {
      printf("[OD][NFC] field-detect IRQ enabled int_no=%ld\r\n", (long)s_od_nfc_field_detect.int_no);
    } else {
      s_od_nfc_field_detect.int_no = -1;
      printf("[OD][NFC] field-detect IRQ setup failed; falling back to polling\r\n");
    }
  }
  {
    uint8_t pin_state = od_read_button_pin(s_od_nfc_field_detect.pin_cfg);
    uint8_t logical = (s_od_nfc_field_detect.active_high ? (pin_state != 0u) : (pin_state == 0u)) ? 1u : 0u;
    /* Start from 0 so the first post-init sample can create a 0->1 scan edge. */
    s_od_nfc_field_detect.state = 0u;
    if (s_od_nfc_field_detect.adv_button_byte_index < sizeof(dynamic_return)) {
      dynamic_return[s_od_nfc_field_detect.adv_button_byte_index] =
        (uint8_t)((s_od_nfc_field_detect.state & 0x01u)
                  | (((s_od_nfc_field_scan_counter & 0x7Fu) << 1) & 0xFEu));
    }
    (void)logical;
  }
  printf("[OD][NFC] field-detect pin=0x%02X state=%u byte_index=%u button_id=%u\r\n",
         (unsigned)s_od_nfc_field_detect.pin_cfg,
         (unsigned)s_od_nfc_field_detect.state,
         (unsigned)s_od_nfc_field_detect.adv_button_byte_index,
         (unsigned)s_od_nfc_field_detect.adv_button_id);
}

static bool od_nfc_field_detect_refresh(uint32_t now_ms, bool force_log)
{
  uint8_t pin_state;
  uint8_t logical;
  uint8_t prev_state;
  bool scan_event = false;

  if (!s_od_nfc_field_detect.enabled) {
    return false;
  }
  if (s_od_nfc_field_detect.adv_button_byte_index >= sizeof(dynamic_return)) {
    return false;
  }

