davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
  pin_state = od_read_button_pin(s_od_nfc_field_detect.pin_cfg);
  logical = (s_od_nfc_field_detect.active_high ? (pin_state != 0u) : (pin_state == 0u)) ? 1u : 0u;
  prev_state = s_od_nfc_field_detect.state;

  if (!force_log && logical == prev_state) {
    return false;
  }
  if (!force_log
      && s_od_nfc_field_detect.debounce_ms != 0u
      && (now_ms - s_od_nfc_field_detect.last_change_ms) < s_od_nfc_field_detect.debounce_ms) {
    return false;
  }

  s_od_nfc_field_detect.last_change_ms = now_ms;
  s_od_nfc_field_detect.state = logical;
  if (logical != 0u && prev_state == 0u) {
    s_od_nfc_field_scan_counter = (uint32_t)((s_od_nfc_field_scan_counter + 1u) & 0x7Fu);
    scan_event = true;
  }
  dynamic_return[s_od_nfc_field_detect.adv_button_byte_index] =
    (uint8_t)((logical & 0x01u)
              | (((s_od_nfc_field_scan_counter & 0x7Fu) << 1) & 0xFEu));

  if (force_log) {
    printf("[OD][NFC] field-detect sample pin=0x%02X raw=%u state=%u ctr7=%lu adv=0x%02X (active_%s)\r\n",
           (unsigned)s_od_nfc_field_detect.pin_cfg,
           (unsigned)pin_state,
           (unsigned)logical,
           (unsigned long)s_od_nfc_field_scan_counter,
           (unsigned)dynamic_return[s_od_nfc_field_detect.adv_button_byte_index],
           s_od_nfc_field_detect.active_high ? "high" : "low");
  } else {
    printf("[OD][NFC] field-detect pin=0x%02X raw=%u state %u->%u ctr7=%lu adv=0x%02X%s (active_%s)\r\n",
           (unsigned)s_od_nfc_field_detect.pin_cfg,
           (unsigned)pin_state,
           (unsigned)prev_state,
           (unsigned)logical,
           (unsigned long)s_od_nfc_field_scan_counter,
           (unsigned)dynamic_return[s_od_nfc_field_detect.adv_button_byte_index],
           scan_event ? " scan++" : "",
           s_od_nfc_field_detect.active_high ? "high" : "low");
  }
  return true;
}

static void od_nfc_field_detect_irq_callback(uint8_t int_no, void *context)
{
  od_nfc_field_detect_t *st = (od_nfc_field_detect_t *)context;
  (void)int_no;
  if (st == NULL || !st->enabled) {
    return;
  }
  st->irq_pending = true;
}

static void od_nfc_field_detect_arm_em4_wakeup(void)
{
  sl_gpio_t gpio;
  sl_status_t sc;
  int32_t em4_int_no = SL_GPIO_INTERRUPT_UNAVAILABLE;

  if (!s_od_nfc_field_detect.enabled) {
    return;
  }

  gpio.port = (sl_gpio_port_t)(s_od_nfc_field_detect.pin_cfg >> 4);
  gpio.pin = (s_od_nfc_field_detect.pin_cfg & 0x0Fu);
  sc = sl_gpio_configure_wakeup_em4_interrupt(&gpio,
                                              &em4_int_no,
                                              s_od_nfc_field_detect.active_high,
                                              od_nfc_field_detect_irq_callback,
                                              &s_od_nfc_field_detect);
  if (sc == SL_STATUS_OK) {
    s_od_nfc_field_detect.em4_int_no = em4_int_no;
    printf("[OD][NFC] EM4 wake armed on field-detect pin=0x%02X em4_int=%ld polarity=%s\r\n",
           (unsigned)s_od_nfc_field_detect.pin_cfg,
           (long)em4_int_no,
           s_od_nfc_field_detect.active_high ? "high" : "low");
  } else {
    printf("[OD][NFC] EM4 wake arm failed pin=0x%02X sc=0x%04lX\r\n",
           (unsigned)s_od_nfc_field_detect.pin_cfg, (unsigned long)sc);
  }
}

static bool od_nfc_field_detect_process(uint32_t now_ms)
{
  if (!s_od_nfc_field_detect.enabled) {
    return false;
  }
  if (s_od_nfc_field_detect.mode == 2u) {
    if (!s_od_nfc_field_detect.irq_pending) {
      return false;
    }
    s_od_nfc_field_detect.irq_pending = false;
    return od_nfc_field_detect_refresh(now_ms, false);
  }
  return od_nfc_field_detect_refresh(now_ms, false);
}

static void od_nfc_autoinit_from_config(const struct GlobalConfig *cfg)
{
  const struct NfcConfig *nfc_cfg = NULL;
  const struct DataBus *bus = NULL;
  uint8_t i;
  GPIO_Port_TypeDef pwr_port;
  uint8_t pwr_pin;

  s_od_nfc_enabled = false;
  s_od_nfc_has_pwr_pin = false;
  s_od_nfc_ic_type = OD_NFC_IC_AUTO;
  s_od_nfc_power_on_delay_ms = 40u;
  memset(&s_od_nfc_field_detect, 0, sizeof(s_od_nfc_field_detect));
  s_od_nfc_field_detect.int_no = -1;

  if (cfg == NULL || !cfg->loaded || cfg->nfc_config_count == 0u) {
    printf("[OD][NFC] no NFC config packet (0x2A); NFC init disabled\r\n");
    return;
  }

  for (i = 0u; i < cfg->nfc_config_count; i++) {
    if ((cfg->nfc_configs[i].flags & 0x01u) != 0u) {
      nfc_cfg = &cfg->nfc_configs[i];
      break;
    }
  }
  if (nfc_cfg == NULL) {
    printf("[OD][NFC] NFC configs present, but none enabled; NFC init disabled\r\n");
    return;
  }

  /* The shared resolver rather than a local scan: this one already keyed on instance_number and
   * was the correct site, but it stopped at the first duplicate and had no bound against a
   * corrupted data_bus_count. One policy, so "declared twice" means no bus everywhere rather than
   * an arbitrary one here. */
  bus = od_config_data_bus(cfg, nfc_cfg->bus_instance);
  s_od_nfc_bus_instance = nfc_cfg->bus_instance;
  if (bus == NULL || bus->bus_type != OD_BUS_TYPE_I2C) {
    printf("[OD][NFC] bus instance=%u missing/non-I2C; NFC init disabled\r\n", (unsigned)nfc_cfg->bus_instance);
    return;
  }
  if (!od_pin_decode(bus->pin_1, &s_od_nfc_scl_port, &s_od_nfc_scl_pin)
      || !od_pin_decode(bus->pin_2, &s_od_nfc_sda_port, &s_od_nfc_sda_pin)) {
    printf("[OD][NFC] bad bus pins for instance=%u; NFC init disabled\r\n", (unsigned)nfc_cfg->bus_instance);
    return;
  }

  s_od_nfc_ic_type = nfc_cfg->nfc_ic_type;
  s_od_nfc_power_on_delay_ms = (nfc_cfg->power_on_delay_ms == 0u) ? 40u : nfc_cfg->power_on_delay_ms;

  if (nfc_cfg->power_pin != GPIO_PIN_UNUSED && od_pin_decode(nfc_cfg->power_pin, &pwr_port, &pwr_pin)) {
    s_od_nfc_has_pwr_pin = true;
    s_od_nfc_pwr_port = pwr_port;
    s_od_nfc_pwr_pin = pwr_pin;
  } else if (od_pin_decode(bus->pin_3, &pwr_port, &pwr_pin)) {
    s_od_nfc_has_pwr_pin = true;
    s_od_nfc_pwr_port = pwr_port;
    s_od_nfc_pwr_pin = pwr_pin;
  }

  if (s_od_nfc_ic_type != OD_NFC_IC_AUTO && s_od_nfc_ic_type != OD_NFC_IC_TNB132M) {
    printf("[OD][NFC] ic_type=%u unsupported yet; NFC init disabled\r\n", (unsigned)s_od_nfc_ic_type);
    return;
  }
  s_od_nfc_enabled = true;
  od_nfc_field_detect_init_from_config(nfc_cfg);
  printf("[OD][NFC] enabled: bus=%u ic_type=%u scl=0x%02X sda=0x%02X pwr=%s\r\n",
         (unsigned)nfc_cfg->bus_instance,
         (unsigned)s_od_nfc_ic_type,
         (unsigned)bus->pin_1,
         (unsigned)bus->pin_2,
         s_od_nfc_has_pwr_pin ? "yes" : "no");
}

static void od_nfc_init_sequence(void)
{
  /* Pin handles for the power/park sequencing this function owns; transactions go by bus. */
  GPIO_Port_TypeDef sp = s_od_nfc_scl_port;
  uint8_t sn = s_od_nfc_scl_pin;
  GPIO_Port_TypeDef dp = s_od_nfc_sda_port;
  uint8_t dn = s_od_nfc_sda_pin;
  const uint8_t bus_id = s_od_nfc_bus_instance;

  if (!s_od_nfc_enabled) {
    return;
  }

