davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
  GPIO_PinModeSet(sp, sn, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(dp, dn, gpioModeWiredAndFilter, 0);
  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModePushPull, 1);
    sl_udelay_wait((uint32_t)s_od_nfc_power_on_delay_ms * 1000u);
  } else {
    sl_udelay_wait(10000);
  }

  od_nfc_tnb132m_prime_type3(bus_id);

#if OD_TNB132M_BOOT_PROBE
  sl_udelay_wait(2000);
#if OD_TNB132M_WRITE_NDEF
  (void)od_nfc_write_ndef_text_en(sp, sn, dp, dn, OD_TNB132M_NDEF_TEXT);
  sl_udelay_wait(50000);
  od_nfc_tnb132m_prime_type3(bus_id);
  sl_udelay_wait(2000);
#endif
  od_nfc_boot_dump_ndef_t3(sp, sn, dp, dn);
  sl_udelay_wait(1000);
#endif

  sl_udelay_wait(20000);

  {
    /* Close the byte-offset window again. Result discarded, as it always was. */
    static const uint8_t close_window[2] = { 0x21u, 0x01u };
    (void)od_hal_i2c_write(bus_id, 0x30u, close_window, (uint16_t)sizeof close_window);
  }

  sl_udelay_wait(14000);
  (void)od_nfc_field_detect_refresh(sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count()), true);

  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinOutClear(s_od_nfc_pwr_port, s_od_nfc_pwr_pin);
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModeInput, 1);
  }
  GPIO_PinModeSet(sp, sn, gpioModeInput, 1);
  GPIO_PinModeSet(dp, dn, gpioModeInput, 1);
}

static bool od_nfc_read_record_raw(uint8_t *type_out, uint8_t *out, uint16_t *io_len, uint16_t out_max)
{
  uint8_t ai[16];
  uint8_t *data = s_od_nfc_read_data;
  uint32_t ln;
  uint16_t off;
  uint16_t tlen;
  uint16_t plen;
  uint16_t copy_len;
  bool sr;
  CORE_DECLARE_IRQ_STATE;

  if (type_out == NULL || io_len == NULL || out == NULL) {
    return false;
  }

  CORE_ENTER_CRITICAL();

  GPIO_PinModeSet(s_od_nfc_scl_port, s_od_nfc_scl_pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(s_od_nfc_sda_port, s_od_nfc_sda_pin, gpioModeWiredAndFilter, 0);
  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModePushPull, 1);
    sl_udelay_wait(40000);
  } else {
    sl_udelay_wait(10000);
  }

  od_nfc_tnb132m_prime_type3(s_od_nfc_bus_instance);
  sl_udelay_wait(2000);
  if (!od_nfc_type3_paged_block_read16(s_od_nfc_bus_instance, 0x48u, 0x00u, ai)) {
    CORE_EXIT_CRITICAL();
    return false;
  }
  if ((ai[0] & 0xF0u) != 0x10u) {
    CORE_EXIT_CRITICAL();
    return false;
  }

  ln = ((uint32_t)ai[11] << 16) | ((uint32_t)ai[12] << 8) | (uint32_t)ai[13];
  if (ln == 0u || ln > sizeof(s_od_nfc_read_data)) {
    CORE_EXIT_CRITICAL();
    return false;
  }
  for (uint16_t b = 0; b < (uint16_t)((ln + 15u) / 16u); b++) {
    uint8_t byte_off = (uint8_t)(0x10u + b * 0x10u);
    (void)od_nfc_type3_paged_block_read16(s_od_nfc_bus_instance, 0x48u, 0x00u, s_od_nfc_read_throwaway);
    sl_udelay_wait(500);
    if (!od_nfc_type3_paged_block_read16(s_od_nfc_bus_instance, 0x40u, byte_off, &data[b * 16u])) {
      CORE_EXIT_CRITICAL();
      return false;
    }
  }

  CORE_EXIT_CRITICAL();

  if (ln < 3u) {
    return false;
  }
  sr = (data[0] & 0x10u) != 0u;
  if (!sr) {
    return false;
  }
  /* IL (payload ID length field present): unsupported — return verbatim NDEF. */
  if ((data[0] & 0x08u) != 0u) {
    if (ln > out_max) {
      return false;
    }
    *io_len = (uint16_t)ln;
    *type_out = OD_NFC_REC_RAW_NDEF;
    memcpy(out, data, *io_len);
    return true;
  }

  tlen = data[1];
  plen = data[2];
  off = 3u;
  if (((uint32_t)off + (uint32_t)tlen + (uint32_t)plen) > ln) {
    return false;
  }

  switch (data[0] & 7u) {
  case 2u: /* NDEF MIME (Media-type): host payload = type string + MIME body byte-for-byte */
  {
    uint16_t out_pack;
    *type_out = OD_NFC_REC_MIME;
    if (plen > 255u || tlen == 0u) {
      return false;
    }
    out_pack = (uint16_t)(1u + tlen + plen);
    if (out_pack > out_max) {
      return false;
    }
    out[0] = tlen;
    memcpy(&out[1], &data[off], tlen);
    memcpy(&out[1u + tlen], &data[(uint16_t)(off + tlen)], plen);
    *io_len = out_pack;
    return true;
  }

  case 1u:
    break;

  default: /* TNF ≠ Well-known/MIME SR: verbatim NDEF (future-proof passthrough). */
    if (ln > out_max) {
      return false;
    }
    *io_len = (uint16_t)ln;
    *type_out = OD_NFC_REC_RAW_NDEF;
    memcpy(out, data, *io_len);
    return true;
  }

  /* Well-known SR (already bounds-checked above). */

  if (tlen == 1u && data[off] == 'T') {
    uint8_t status;
    uint8_t lang_len;
    *type_out = OD_NFC_REC_TEXT;
    off = (uint16_t)(off + 1u);
    if (plen < 1u) {
      return false;
    }
    status = data[off];
    lang_len = status & 0x3Fu;
    if ((uint16_t)(1u + lang_len) > plen) {
      return false;
    }
    off = (uint16_t)(off + 1u + lang_len);
    copy_len = (uint16_t)(plen - 1u - lang_len);
  } else if (tlen == 1u && data[off] == 'U') {
    uint8_t uri_prefix;
    *type_out = OD_NFC_REC_URI;
    off = (uint16_t)(off + 1u);
    if (plen < 1u) {
      return false;
    }
    uri_prefix = data[off];
    if (uri_prefix != 0x00u) {
      return false;
    }
    off = (uint16_t)(off + 1u);
    copy_len = (uint16_t)(plen - 1u);
  } else {
    uint16_t raw_len;
    *type_out = OD_NFC_REC_WELL_KNOWN_RAW;
    raw_len = (uint16_t)(1u + tlen + plen);
    if (raw_len > out_max) {
      return false;
    }
    if (raw_len == 0u) {
      *io_len = 0u;
      return true;
    }
    out[0] = tlen;
    copy_len = (uint16_t)(raw_len - 1u);
    memcpy(&out[1], &data[off], copy_len);
    *io_len = raw_len;
    return true;
  }

  if (copy_len > out_max) {
    return false;
  }
  memcpy(out, &data[off], copy_len);
  *io_len = copy_len;
  return true;
}

static bool od_nfc_write_record_raw(uint8_t rec_type, const uint8_t *data, uint16_t data_len)
{
  uint8_t ai[16] = { 0 };
  uint8_t cur_ai[16];
  uint8_t *blocks = s_od_nfc_write_blocks;
  uint16_t sum;
  uint16_t record_len;
  uint16_t payload_len;
  uint8_t need_blocks;
  uint8_t i;
  CORE_DECLARE_IRQ_STATE;

  if (data == NULL || data_len == 0u) {
    return false;
  }
  /* Defense-in-depth: bound data_len so the uint16_t payload_len math below
   * (1 + hdr + data_len) cannot wrap and overrun s_od_nfc_write_blocks. Callers
   * validate too, but this keeps the record builder memory-safe on its own. */
  if (data_len > sizeof(s_od_nfc_write_blocks)) {
    return false;
  }
  memset(blocks, 0, sizeof(s_od_nfc_write_blocks));

  if (rec_type == OD_NFC_REC_TEXT) {
    payload_len = (uint16_t)(1u + 2u + data_len);
    if (payload_len > 255u || payload_len > (uint16_t)(sizeof(s_od_nfc_write_blocks) - 4u)) {
      return false;
    }
    record_len = (uint16_t)(4u + payload_len);
    blocks[0] = 0xD1u;
    blocks[1] = 0x01u;
    blocks[2] = (uint8_t)payload_len;
    blocks[3] = 0x54u;
    blocks[4] = 0x02u;
    blocks[5] = (uint8_t)'e';
    blocks[6] = (uint8_t)'n';
    memcpy(&blocks[7], data, data_len);
  } else if (rec_type == OD_NFC_REC_URI) {
    payload_len = (uint16_t)(1u + data_len);
    if (payload_len > 255u || payload_len > (uint16_t)(sizeof(s_od_nfc_write_blocks) - 4u)) {
      return false;
    }
    record_len = (uint16_t)(4u + payload_len);
    blocks[0] = 0xD1u;
    blocks[1] = 0x01u;
    blocks[2] = (uint8_t)payload_len;
    blocks[3] = 0x55u;
    blocks[4] = 0x00u;
    memcpy(&blocks[5], data, data_len);
  } else if (rec_type == OD_NFC_REC_WELL_KNOWN_RAW) {
    uint8_t type_len;
    uint16_t raw_payload_len;
    if (data_len < 2u) {
      return false;
    }
    type_len = data[0];
    if (type_len == 0u || (uint16_t)(1u + type_len) > data_len) {
      return false;
    }
    raw_payload_len = (uint16_t)(data_len - 1u - type_len);
    if (raw_payload_len > 255u) {
      return false;
    }
    record_len = (uint16_t)(3u + type_len + raw_payload_len);
    if (record_len > sizeof(s_od_nfc_write_blocks)) {
      return false;
    }
    blocks[0] = 0xD1u;
    blocks[1] = type_len;
    blocks[2] = (uint8_t)raw_payload_len;
    memcpy(&blocks[3], &data[1], type_len);
    if (raw_payload_len > 0u) {
      memcpy(&blocks[3u + type_len], &data[1u + type_len], raw_payload_len);
    }
  } else if (rec_type == OD_NFC_REC_MIME) {
    uint8_t mime_tl;
    uint16_t body_len;

    if (data_len < 3u) {
      return false;
    }
    mime_tl = data[0];
    if (mime_tl == 0u || (uint16_t)(1u + mime_tl) > data_len) {
      return false;
    }
    body_len = (uint16_t)(data_len - 1u - mime_tl);
    if (body_len > 255u) {
      return false;
    }
    record_len = (uint16_t)(3u + mime_tl + body_len);
    if (record_len > sizeof(s_od_nfc_write_blocks)) {
      return false;
    }
    blocks[0] = 0xD2u; /* MB | ME | SR ; TNF = MIME */
    blocks[1] = mime_tl;
    blocks[2] = (uint8_t)body_len;
    memcpy(&blocks[3], &data[1], mime_tl);
    if (body_len > 0u) {
      memcpy(&blocks[3u + mime_tl], &data[1u + mime_tl], body_len);
    }
  } else if (rec_type == OD_NFC_REC_RAW_NDEF) {
    record_len = data_len;
    if (record_len == 0u || record_len > sizeof(s_od_nfc_write_blocks)) {
      return false;
    }
    memcpy(blocks, data, record_len);
  } else {
    return false;
  }

  CORE_ENTER_CRITICAL();

