davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
  GPIO_PinModeSet(s_od_nfc_scl_port, s_od_nfc_scl_pin, gpioModeWiredAndFilter, 0);
  GPIO_PinModeSet(s_od_nfc_sda_port, s_od_nfc_sda_pin, gpioModeWiredAndFilter, 0);
  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModePushPull, 1);
    sl_udelay_wait(40000);
  } else {
    sl_udelay_wait(10000);
  }

  od_nfc_tnb132m_prime_type3(s_od_nfc_bus_instance);
  sl_udelay_wait(2000);

  ai[0] = 0x10u;
  ai[1] = 0x02u;
  ai[2] = 0x01u;
  ai[3] = 0x00u;
  ai[4] = 0x3Cu;
  ai[11] = (uint8_t)((record_len >> 16) & 0xFFu);
  ai[12] = (uint8_t)((record_len >> 8) & 0xFFu);
  ai[13] = (uint8_t)(record_len & 0xFFu);

  if (od_nfc_type3_paged_block_read16(s_od_nfc_bus_instance, 0x48u, 0x00u, cur_ai)
      && (cur_ai[0] & 0xF0u) == 0x10u) {
    ai[10] = cur_ai[10];
  }
  sum = 0u;
  for (i = 0u; i < 14u; i++) {
    sum = (uint16_t)(sum + ai[i]);
  }
  ai[14] = (uint8_t)(sum >> 8);
  ai[15] = (uint8_t)(sum & 0xFFu);

  if (!od_nfc_type3_paged_block_write16(s_od_nfc_bus_instance, 0x48u, 0x00u, ai)) {
    CORE_EXIT_CRITICAL();
    return false;
  }
  sl_udelay_wait(10000);
  need_blocks = (uint8_t)((record_len + 15u) / 16u);
  for (i = 0u; i < need_blocks; i++) {
    uint8_t byte_off = (uint8_t)(0x10u + i * 0x10u);
    if (!od_nfc_type3_paged_block_write16(s_od_nfc_bus_instance, 0x40u, byte_off, &blocks[i * 16u])) {
      CORE_EXIT_CRITICAL();
      return false;
    }
    sl_udelay_wait(10000);
  }

  CORE_EXIT_CRITICAL();
  return true;
}

static void od_flash_autoinit_from_config(const struct GlobalConfig *cfg)
{
  const struct FlashConfig *flash_cfg = NULL;
  uint8_t i;

  s_od_flash_enabled = false;
  if (cfg == NULL || !cfg->loaded || cfg->flash_config_count == 0u) {
    printf("[OD][FLASH] no flash config packet (0x2B); flash deep-sleep config disabled\r\n");
    return;
  }
  for (i = 0u; i < cfg->flash_config_count; i++) {
    if ((cfg->flash_configs[i].flags & 0x01u) != 0u) {
      flash_cfg = &cfg->flash_configs[i];
      break;
    }
  }
  if (flash_cfg == NULL) {
    printf("[OD][FLASH] flash configs present, but none enabled\r\n");
    return;
  }
  if (!od_pin_decode(flash_cfg->mosi_pin, &s_od_flash_mosi_port, &s_od_flash_mosi_pin)
      || !od_pin_decode(flash_cfg->sck_pin, &s_od_flash_sck_port, &s_od_flash_sck_pin)
      || !od_pin_decode(flash_cfg->cs_pin, &s_od_flash_cs_port, &s_od_flash_cs_pin)) {
    printf("[OD][FLASH] bad MOSI/SCK/CS pins in flash config; flash deep-sleep config disabled\r\n");
    return;
  }
  s_od_flash_enabled = true;
  printf("[OD][FLASH] enabled mosi=0x%02X sck=0x%02X cs=0x%02X\r\n",
         (unsigned)flash_cfg->mosi_pin, (unsigned)flash_cfg->sck_pin, (unsigned)flash_cfg->cs_pin);
}

static void od_flash_enter_deep_sleep(void)
{
  uint8_t cmd = 0xB9u;

  if (!s_od_flash_enabled) {
    return;
  }

  GPIO_PinModeSet(s_od_flash_mosi_port, s_od_flash_mosi_pin, gpioModePushPull, 0);
  GPIO_PinModeSet(s_od_flash_sck_port, s_od_flash_sck_pin, gpioModePushPull, 0);
  GPIO_PinModeSet(s_od_flash_cs_port, s_od_flash_cs_pin, gpioModePushPull, 1);

  GPIO_PinOutClear(s_od_flash_cs_port, s_od_flash_cs_pin);
  for (uint8_t bit = 0; bit < 8u; bit++) {
    bool one = (cmd & 0x80u) != 0u;
    if (one) {
      GPIO_PinOutSet(s_od_flash_mosi_port, s_od_flash_mosi_pin);
    } else {
      GPIO_PinOutClear(s_od_flash_mosi_port, s_od_flash_mosi_pin);
    }
    cmd <<= 1;
    sl_udelay_wait(1);
    GPIO_PinOutSet(s_od_flash_sck_port, s_od_flash_sck_pin);
    sl_udelay_wait(1);
    GPIO_PinOutClear(s_od_flash_sck_port, s_od_flash_sck_pin);
  }
  GPIO_PinOutSet(s_od_flash_cs_port, s_od_flash_cs_pin);
  sl_udelay_wait(30);
}

static void od_init_aux_peripherals(void)
{
  CMU_ClockEnable(cmuClock_GPIO, true);

  od_nfc_autoinit_from_config(&s_od_global_config);
  od_nfc_init_sequence();
  od_flash_autoinit_from_config(&s_od_global_config);

  od_flash_enter_deep_sleep();

  if (s_od_flash_enabled) {
    /* Park external flash SPI lines in passive states. */
    GPIO_PinModeSet(s_od_flash_mosi_port, s_od_flash_mosi_pin, gpioModeInputPull, 1);
    GPIO_PinModeSet(s_od_flash_sck_port, s_od_flash_sck_pin, gpioModeInputPull, 0);
    GPIO_PinModeSet(s_od_flash_cs_port, s_od_flash_cs_pin, gpioModeInputPull, 1);
  }
}

const struct GlobalConfig *opendisplay_get_global_config(void)
{
  return &s_od_global_config;
}

void opendisplay_ble_reload_config_from_nvm(void)
{
  if (!loadGlobalConfig(&s_od_global_config)) {
    printf("[OD] config: reload after save failed\r\n");
  }
  od_buttons_init_from_config();
  opendisplay_display_park_pins();
  opendisplay_led_init();
  opendisplay_display_boot_apply();
}

static sl_status_t od_apply_advertising_timing(uint8_t adv_handle, uint32_t now_ms)
{
  sl_status_t sc;
  uint16_t min_slots;
  uint16_t max_slots;

  if (adv_handle == 0xFFu) {
    return SL_STATUS_OK;
  }
  if (s_adv_boost_until_ms != 0u && now_ms < s_adv_boost_until_ms) {
    min_slots = OD_ADV_INTERVAL_BOOST_MIN;
    max_slots = OD_ADV_INTERVAL_BOOST_MAX;
  } else {
    s_adv_boost_until_ms = 0u;
    min_slots = OD_ADV_INTERVAL_IDLE_SLOTS;
    max_slots = OD_ADV_INTERVAL_IDLE_SLOTS;
  }
  sc = sl_bt_advertiser_set_timing(adv_handle, min_slots, max_slots, 0, 0);
  if (sc != SL_STATUS_OK) {
    printf("[OD] advertiser_set_timing sc=0x%04lX\r\n", (unsigned long)sc);
  }
  return sc;
}

static void od_boost_advertising(uint32_t now_ms)
{
  s_adv_boost_until_ms = now_ms + OD_ADV_BOOST_MS;
}

static void od_advertising_boost_tick(uint8_t adv_handle, uint32_t now_ms)
{
  static bool was_boosted = false;
  bool boosting = (s_adv_boost_until_ms != 0u && now_ms < s_adv_boost_until_ms);

  if (boosting) {
    was_boosted = true;
    return;
  }
  if (!was_boosted) {
    return;
  }
  was_boosted = false;
  s_adv_boost_until_ms = 0u;
  if (!od_advertising_api_ok(od_apply_advertising_timing(adv_handle, now_ms),
                             "advertising boost timing")) {
    return;
  }
  if (g_connection == 0xFFu) {
    (void)sl_bt_advertiser_stop(adv_handle);
    (void)od_advertising_api_ok(sl_bt_legacy_advertiser_start(
                                   adv_handle, sl_bt_legacy_advertiser_connectable),
                               "advertising boost restart");
  }
}

static void chip_id_hex6(char out[7])
{
  uint64_t u = SYSTEM_GetUnique();
  uint32_t id = (uint32_t)(u & 0xFFFFFFu);
  snprintf(out, 7, "%06lX", (unsigned long)id);
}

