davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
static void update_msd_payload(bool quick)
{
  float chip_temperature = EMU_TemperatureGet();
  uint32_t now_ms = sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count());
  bool measure_batt = !quick
                      && ((s_batt_voltage_mv_cache == 0u)
                          || ((now_ms - s_last_batt_measure_ms) > OD_MSD_UPDATE_INTERVAL_MS));
  struct od_advert_inputs adv_in;
  uint32_t sample;
  IADC_Init_t init = IADC_INIT_DEFAULT;
  IADC_AllConfigs_t initAllConfigs = IADC_ALLCONFIGS_DEFAULT;
  IADC_InitSingle_t initSingle = IADC_INITSINGLE_DEFAULT;
  IADC_SingleInput_t initSingleInput = IADC_SINGLEINPUT_DEFAULT;

  if (measure_batt) {
    CMU_ClockEnable(cmuClock_IADC0, true);
    IADC_reset(IADC0);
    CMU_ClockSelectSet(cmuClock_IADCCLK, cmuSelect_FSRCO);
    init.warmup = iadcWarmupNormal;
    init.srcClkPrescale = IADC_calcSrcClkPrescale(IADC0, 20000000, 0);
    initAllConfigs.configs[0].reference = iadcCfgReferenceInt1V2;
    initAllConfigs.configs[0].vRef = 1210;
    initAllConfigs.configs[0].osrHighSpeed = iadcCfgOsrHighSpeed2x;
    initAllConfigs.configs[0].analogGain = iadcCfgAnalogGain1x;
    initAllConfigs.configs[0].adcClkPrescale = IADC_calcAdcClkPrescale(
      IADC0, 10000000, 0, iadcCfgModeNormal, init.srcClkPrescale);
    initSingleInput.posInput = iadcPosInputAvdd;
    initSingleInput.negInput = iadcNegInputGnd;
    IADC_init(IADC0, &init, &initAllConfigs);
    IADC_initSingle(IADC0, &initSingle, &initSingleInput);
    IADC_command(IADC0, iadcCmdStartSingle);
    while ((IADC0->STATUS & (_IADC_STATUS_CONVERTING_MASK | _IADC_STATUS_SINGLEFIFODV_MASK))
           != IADC_STATUS_SINGLEFIFODV) {
    }
    sample = IADC_pullSingleFifoResult(IADC0).data;
    s_batt_voltage_mv_cache = (uint16_t)((sample * 4u * 1200u) / 4095u);
    s_last_batt_measure_ms = now_ms;
    IADC_command(IADC0, iadcCmdStopSingle);
    IADC_reset(IADC0);
    CMU_ClockEnable(cmuClock_IADC0, false);
  }
  /* Encoding -- company id, the 0.5 C / -40 C temperature step, the 10-bit battery split across
   * battery_voltage_low and status bit0, the status bit positions -- is shared/core/od_advert.c.
   * What stays here is acquisition: the die temperature and the IADC read above, which are the
   * only parts of this that are the BG22's own. */
  memset(&adv_in, 0, sizeof(adv_in));
  adv_in.dynamic = dynamic_return;
  adv_in.chip_temperature_c = chip_temperature;
  adv_in.battery_10mv = od_advert_battery_10mv_from_mv(s_batt_voltage_mv_cache);
  adv_in.reboot_flag = (reboot_flag != 0u);
  adv_in.connection_requested = (connection_requested != 0u);
  adv_in.loop_counter = msd_loop_counter;
  od_advert_build(&adv_in, msd_payload);

  msd_loop_counter = od_advert_advance_counter(msd_loop_counter);
}

static sl_status_t set_gap_device_name(const char *name)
{
  size_t len = strlen(name);
  return sl_bt_gatt_server_write_attribute_value(gattdb_device_name, 0, len, (const uint8_t *)name);
}

static sl_status_t install_opendisplay_gatt(void)
{
  uint16_t session;
  uint16_t svc;
  uint16_t ch_pipe;
  sl_bt_uuid_16_t uuid_svc = { .data = { 0x46, 0x24 } };
  sl_bt_uuid_16_t uuid_pipe = { .data = { 0x46, 0x24 } };
  uint8_t pipe_init = 0;
  sl_status_t sc;

  sc = sl_bt_gattdb_new_session(&session);
  if (sc != SL_STATUS_OK) {
    return sc;
  }

  sc = sl_bt_gattdb_add_service(session,
                                sl_bt_gattdb_primary_service,
                                0,
                                sizeof(uuid_svc.data),
                                uuid_svc.data,
                                &svc);
  if (sc != SL_STATUS_OK) {
    (void)sl_bt_gattdb_abort(session);
    return sc;
  }

  sc = sl_bt_gattdb_add_uuid16_characteristic(session,
                                              svc,
                                              SL_BT_GATTDB_CHARACTERISTIC_READ
                                                | SL_BT_GATTDB_CHARACTERISTIC_WRITE
                                                | SL_BT_GATTDB_CHARACTERISTIC_WRITE_NO_RESPONSE
                                                | SL_BT_GATTDB_CHARACTERISTIC_NOTIFY,
                                              0,
                                              0,
                                              uuid_pipe,
                                              sl_bt_gattdb_variable_length_value,
                                              OD_BLE_MAX_FRAME - 3u,
                                              1,
                                              &pipe_init,
                                              &ch_pipe);
  if (sc != SL_STATUS_OK) {
    (void)sl_bt_gattdb_abort(session);
    return sc;
  }

  sc = sl_bt_gattdb_start_service(session, svc);
  if (sc != SL_STATUS_OK) {
    (void)sl_bt_gattdb_abort(session);
    return sc;
  }

  sc = sl_bt_gattdb_commit(session);
  if (sc != SL_STATUS_OK) {
    return sc;
  }

  g_od_pipe_char = ch_pipe;
  return SL_STATUS_OK;
}

static sl_status_t build_and_apply_adv(uint8_t adv_set, const char *name, bool quick)
{
  uint8_t adv[31];
  uint8_t sr[31];
  size_t ai = 0;
  size_t si = 0;
  size_t nl = strlen(name);
  sl_status_t sc;

  update_msd_payload(quick);

  adv[ai++] = 2u;
  adv[ai++] = 0x01u;
  adv[ai++] = 0x06u;

  /* The AD structure is the 0xFF type byte plus the 16 MSD bytes. Copied whole: bytes 0-1 of
   * msd_payload ARE the company id, so writing it again here was a second definition of the
   * constant that could disagree with the encoder's. */
  adv[ai++] = 1u + OD_ADVERT_MSD_LEN;
  adv[ai++] = 0xFFu;
  memcpy(&adv[ai], msd_payload, OD_ADVERT_MSD_LEN);
  ai += OD_ADVERT_MSD_LEN;

  if (ai + 2 + nl > sizeof(adv)) {
    nl = sizeof(adv) - ai - 2;
  }
  adv[ai++] = (uint8_t)(1 + nl);
  adv[ai++] = 0x09u;
  memcpy(&adv[ai], name, nl);
  ai += nl;

  sr[si++] = 3u;
  sr[si++] = 0x03u;
  sr[si++] = 0x46u;
  sr[si++] = 0x24u;

  sc = sl_bt_legacy_advertiser_set_data(adv_set,
                                        sl_bt_advertiser_advertising_data_packet,
                                        ai,
                                        adv);
  if (sc != SL_STATUS_OK) {
    printf("[OD] legacy_advertiser_set_data(adv) sc=0x%04lX len=%u\r\n",
           (unsigned long)sc, (unsigned)ai);
    return sc;
  }
  sc = sl_bt_legacy_advertiser_set_data(adv_set,
                                        sl_bt_advertiser_scan_response_packet,
                                        si,
                                        sr);
  if (sc != SL_STATUS_OK) {
    printf("[OD] legacy_advertiser_set_data(sr) sc=0x%04lX len=%u\r\n",
           (unsigned long)sc, (unsigned)si);
  }
  return sc;
}

void opendisplay_ble_on_boot(uint8_t advertising_set_handle)
{
  char hex[7];
  sl_status_t sc;
  uint16_t selected_mtu = 0u;

