davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
  /* An API failure and a smaller selected maximum are different outcomes. The first means the
   * application cannot establish what the stack supports, so hand control to the independently
   * installed Gecko AppLoader. The second is a valid stack result: continue with the selected
   * ceiling and let each connection narrow it further through ATT MTU exchange. */
  sc = sl_bt_gatt_server_set_max_mtu(OD_BLE_MAX_FRAME, &selected_mtu);
  if (sc != SL_STATUS_OK) {
    printf("[OD] FATAL: max ATT MTU API failed request=%u sc=0x%04lX; entering bootloader\r\n",
           (unsigned)OD_BLE_MAX_FRAME, (unsigned long)sc);
    od_enter_gecko_bootloader();
    return;
  }
  if (selected_mtu != OD_BLE_MAX_FRAME) {
    /* This is not an API failure. The stack enforces the resulting bound on every notification,
     * so a lower selection is a degraded operating maximum, not a broken device. */
    printf("[OD] DEGRADED: max ATT MTU request=%u selected=%u; large replies may be refused\r\n",
           (unsigned)OD_BLE_MAX_FRAME, (unsigned)selected_mtu);
  } else {
    printf("[OD] max ATT MTU selected=%u (value max=%u)\r\n", (unsigned)selected_mtu,
           (unsigned)(selected_mtu - 3u));
  }

  /* Eight is deliberately bounded. The app queue can contribute at most two packets per command;
   * if the stack ever accumulates more than eight, the report's overflow flag makes END fail
   * closed rather than claiming its ACK reached the air. This must precede every connection. */
  sc = sl_bt_resource_enable_connection_tx_report(8u);
  if (sc != SL_STATUS_OK) {
    /* This is a boot-time stack configuration API failure, not a peer negotiation result. Running
     * without it cannot satisfy D5's on-air completion contract, so remain recoverable through the
     * independently installed AppLoader instead of asserting or exposing a partial application. */
    printf("[OD] FATAL: connection TX report API failed sc=0x%04lX; entering bootloader\r\n",
           (unsigned long)sc);
    od_enter_gecko_bootloader();
    return;
  }
  opendisplay_pipe_set_tx_report_available(true);

  if (loadGlobalConfig(&s_od_global_config)) {
    printf("[OD] config: loaded displays=%u leds=%u buses=%u nfc=%u flash=%u ver=%u.%u\r\n",
           (unsigned)s_od_global_config.display_count,
           (unsigned)s_od_global_config.led_count,
           (unsigned)s_od_global_config.data_bus_count,
           (unsigned)s_od_global_config.nfc_config_count,
           (unsigned)s_od_global_config.flash_config_count,
           (unsigned)s_od_global_config.version,
           (unsigned)s_od_global_config.minor_version);
  } else {
    printf("[OD] config: none or invalid (defaults)\r\n");
  }

  od_init_aux_peripherals();

  s_adv_handle = advertising_set_handle;
  printf("[OD] BLE boot: adv_set=%u\r\n", (unsigned)advertising_set_handle);

  chip_id_hex6(hex);
  snprintf(s_dev_name, sizeof(s_dev_name), "%s%s", OD_NAME_PREFIX, hex);
  printf("[OD] GAP name: %s\r\n", s_dev_name);

  sc = set_gap_device_name(s_dev_name);
  if (sc != SL_STATUS_OK) {
    printf("[OD] set_gap_device_name sc=0x%04lX\r\n", (unsigned long)sc);
  }
  app_assert_status(sc);

  sc = install_opendisplay_gatt();
  if (sc != SL_STATUS_OK) {
    printf("[OD] install_opendisplay_gatt sc=0x%04lX", (unsigned long)sc);
    if (sc == SL_STATUS_NOT_SUPPORTED) {
      printf(" (SL_STATUS_NOT_SUPPORTED: add bluetooth_feature_dynamic_gattdb)\r\n");
    } else {
      printf("\r\n");
    }
  }
  app_assert_status(sc);
  printf("[OD] GATT 0x2446 ok, pipe_char=%u\r\n", (unsigned)g_od_pipe_char);
  opendisplay_pipe_set_characteristic(g_od_pipe_char);

  od_buttons_init_from_config();
  opendisplay_display_park_pins();
  opendisplay_led_init();
  opendisplay_display_boot_apply();

  if (!od_advertising_api_ok(build_and_apply_adv(advertising_set_handle, s_dev_name, false),
                             "boot advertising data setup")) {
    return;
  }
  printf("[OD] advertising + scan rsp set\r\n");

  if (!od_advertising_api_ok(
          od_apply_advertising_timing(
              advertising_set_handle,
              sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count())),
          "boot advertising timing")) {
    return;
  }

  sc = sl_bt_legacy_advertiser_start(advertising_set_handle, sl_bt_legacy_advertiser_connectable);
  if (!od_advertising_api_ok(sc, "boot advertising start")) {
    return;
  }
  printf("[OD] advertising started (~1 s interval while idle)\r\n");
}

static bool opendisplay_ble_restart_advertising(uint8_t advertising_set_handle)
{
  sl_status_t sc;

  if (!od_advertising_api_ok(build_and_apply_adv(advertising_set_handle, s_dev_name, false),
                             "advertising restart data setup") ||
      !od_advertising_api_ok(
          od_apply_advertising_timing(
              advertising_set_handle,
              sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count())),
          "advertising restart timing")) {
    return false;
  }
  sc = sl_bt_legacy_advertiser_start(advertising_set_handle,
                                     sl_bt_legacy_advertiser_connectable);
  if (!od_advertising_api_ok(sc, "advertising restart")) {
    return false;
  }
  return true;
}

void opendisplay_ble_on_event(sl_bt_msg_t *evt)
{
  opendisplay_pipe_handle_gatt_event(evt);

  switch (SL_BT_MSG_ID(evt->header)) {
    case sl_bt_evt_connection_opened_id:
      g_connection = evt->data.evt_connection_opened.connection;
      s_connection_open_ms = sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count());
      s_connection_timeout_close_requested = false;
      reboot_flag = 0u;
      printf("[OD] connection opened handle=%u\r\n", (unsigned)g_connection);
      /* Connectable advertising stops automatically when this event is generated. */
      break;
    case sl_bt_evt_connection_closed_id:
      g_connection = 0xFF;
      s_connection_open_ms = 0u;
      s_connection_timeout_close_requested = false;
      /* opendisplay_pipe_handle_gatt_event() already reset the shared transport/session at the
       * top of this function. Repeating it here advances the TXQ generation twice and aborts the
       * display twice for one close event. */
      printf("[OD] connection closed reason=0x%02X\r\n",
             (unsigned)evt->data.evt_connection_closed.reason);
      if (s_adv_handle != 0xFFu) {
        if (opendisplay_ble_restart_advertising(s_adv_handle)) {
          printf("[OD] advertising resumed after disconnect\r\n");
        }
      }
      break;
    default:
      (void)g_od_pipe_char;
      break;
  }
}

void opendisplay_ble_schedule_dfu(void)
{
  s_pending_dfu = true;
}

void opendisplay_ble_schedule_deep_sleep(void)
{
  s_pending_deep_sleep = true;
}

