davelee98/Firmware_Unified/targets/efr32bg22-slc/opendisplay_ble.c
void opendisplay_ble_process(void)
{
  opendisplay_pipe_process();
  opendisplay_led_process();
  uint32_t now_ms = sl_sleeptimer_tick_to_ms(sl_sleeptimer_get_tick_count());
  od_publish_button_msd(s_adv_handle, now_ms);
  if (s_adv_handle != 0xFFu) {
    od_advertising_boost_tick(s_adv_handle, now_ms);
  }
  if (od_nfc_field_detect_process(now_ms) && s_adv_handle != 0xFFu) {
    if (!od_advertising_api_ok(build_and_apply_adv(s_adv_handle, s_dev_name, false),
                               "NFC advertising data update")) {
      return;
    }
  }
  if ((now_ms - s_last_msd_refresh_ms) >= OD_MSD_UPDATE_INTERVAL_MS) {
    s_last_msd_refresh_ms = now_ms;
    if (s_adv_handle != 0xFFu) {
      if (!od_advertising_api_ok(build_and_apply_adv(s_adv_handle, s_dev_name, false),
                                 "periodic advertising data update")) {
        return;
      }
    }
  }
  if (g_connection != 0xFFu
      && !s_connection_timeout_close_requested
      && (now_ms - s_connection_open_ms) >= OD_MAX_CONNECTION_MS) {
    sl_status_t sc = sl_bt_connection_close(g_connection);
    if (sc == SL_STATUS_OK) {
      s_connection_timeout_close_requested = true;
      printf("[OD] connection timeout (%lu ms): closing handle=%u\r\n",
             (unsigned long)OD_MAX_CONNECTION_MS, (unsigned)g_connection);
    } else {
      printf("[OD] connection timeout close failed sc=0x%04lX\r\n", (unsigned long)sc);
    }
  }

  if (s_pending_dfu || s_pending_deep_sleep) {
    if (g_connection != 0xFFu) {
      (void)sl_bt_connection_close(g_connection);
      return;
    }
    if (s_pending_dfu) {
      s_pending_dfu = false;
      printf("[OD] DFU: entering bootloader\r\n");
      od_enter_gecko_bootloader();
      return;
    }
    if (s_pending_deep_sleep) {
      s_pending_deep_sleep = false;
      opendisplay_display_power_off();
      od_buttons_arm_em4_wakeup();
      od_nfc_field_detect_arm_em4_wakeup();
      EMU_EnterEM4();
    }
  }
}

uint16_t opendisplay_ble_get_app_version(void)
{
  if (fw_build_version_string() != NULL) {
    return ((uint16_t)fw_major_from_build_version() << 8) |
           fw_minor_from_build_version();
  }
  return (uint16_t)OD_APP_VERSION;
}

uint8_t opendisplay_ble_get_app_version_patch(void)
{
  if (fw_build_version_string() != NULL) {
    return fw_patch_from_build_version();
  }
  return 0;
}

void opendisplay_ble_copy_msd_bytes(uint8_t out[16])
{
  memcpy(out, msd_payload, 16);
}

bool od_nfc_app_read(uint8_t *type_out, uint8_t *data_out, uint16_t *data_len_io, uint16_t max_len)
{
  bool ok;

  if (!s_od_nfc_enabled) {
    return false;
  }
  ok = od_nfc_read_record_raw(type_out, data_out, data_len_io, max_len);

  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinOutClear(s_od_nfc_pwr_port, s_od_nfc_pwr_pin);
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModeInput, 1);
  }
  GPIO_PinModeSet(s_od_nfc_scl_port, s_od_nfc_scl_pin, gpioModeInput, 1);
  GPIO_PinModeSet(s_od_nfc_sda_port, s_od_nfc_sda_pin, gpioModeInput, 1);
  return ok;
}

bool od_nfc_app_write(uint8_t type, const uint8_t *data, uint16_t data_len)
{
  bool ok;

  if (!s_od_nfc_enabled) {
    return false;
  }
  ok = od_nfc_write_record_raw(type, data, data_len);

  if (s_od_nfc_has_pwr_pin) {
    GPIO_PinOutClear(s_od_nfc_pwr_port, s_od_nfc_pwr_pin);
    GPIO_PinModeSet(s_od_nfc_pwr_port, s_od_nfc_pwr_pin, gpioModeInput, 1);
  }
  GPIO_PinModeSet(s_od_nfc_scl_port, s_od_nfc_scl_pin, gpioModeInput, 1);
  GPIO_PinModeSet(s_od_nfc_sda_port, s_od_nfc_sda_pin, gpioModeInput, 1);
  return ok;
}
